GetNonControlledTemplateParameterIds Method
 Returns a list of parameters that are not marked as included when this view is used as a template.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2013
 Syntax
  C#
public ICollection<ElementId> GetNonControlledTemplateParameterIds()
  Visual Basic
Public Function GetNonControlledTemplateParameterIds As ICollection(Of ElementId)
  Visual C++
public:
ICollection<ElementId^>^ GetNonControlledTemplateParameterIds()
 Return Value
 The parameter ids that are not marked to be included.
 Remarks
 This is a subset of the parameters returned by  GetTemplateParameterIds  .
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →